### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy

Terraform will perform the following actions:

  # aws_budgets_budget.total will be destroyed
  # (because resource uses count or for_each)
-   resource "aws_budgets_budget" "total" {
-       account_id        = "629415618746" -> null
-       arn               = "arn:aws:budgets::629415618746:budget/total_budgets" -> null
-       budget_type       = "COST" -> null
-       cost_filters      = {} -> null
-       id                = "629415618746:total_budgets" -> null
-       limit_amount      = "10.0" -> null
-       limit_unit        = "USD" -> null
-       name              = "total_budgets" -> null
-       time_period_end   = "2087-06-15_00:00" -> null
-       time_period_start = "2021-11-01_00:00" -> null
-       time_unit         = "MONTHLY" -> null

-       cost_types {
-           include_credit             = true -> null
-           include_discount           = true -> null
-           include_other_subscription = true -> null
-           include_recurring          = true -> null
-           include_refund             = true -> null
-           include_subscription       = true -> null
-           include_support            = true -> null
-           include_tax                = true -> null
-           include_upfront            = true -> null
-           use_amortized              = true -> null
-           use_blended                = false -> null
        }

-       notification {
-           comparison_operator        = "GREATER_THAN" -> null
-           notification_type          = "FORECASTED" -> null
-           subscriber_email_addresses = [
-               "kiririmode@gmail.com",
            ] -> null
-           subscriber_sns_topic_arns  = [] -> null
-           threshold                  = 20 -> null
-           threshold_type             = "PERCENTAGE" -> null
        }
    }

  # aws_budgets_budget.total["ACTUAL"] will be created
+   resource "aws_budgets_budget" "total" {
+       account_id        = (known after apply)
+       arn               = (known after apply)
+       budget_type       = "COST"
+       cost_filters      = (known after apply)
+       id                = (known after apply)
+       limit_amount      = "10"
+       limit_unit        = "USD"
+       name              = "total_budgets"
+       name_prefix       = (known after apply)
+       time_period_end   = "2087-06-15_00:00"
+       time_period_start = (known after apply)
+       time_unit         = "MONTHLY"

+       cost_filter {
+           name   = (known after apply)
+           values = (known after apply)
        }

+       cost_types {
+           include_credit             = true
+           include_discount           = true
+           include_other_subscription = true
+           include_recurring          = true
+           include_refund             = true
+           include_subscription       = true
+           include_support            = true
+           include_tax                = true
+           include_upfront            = true
+           use_amortized              = true
+           use_blended                = false
        }

+       notification {
+           comparison_operator        = "GREATER_THAN"
+           notification_type          = "ACTUAL"
+           subscriber_email_addresses = [
+               "kiririmode@gmail.com",
            ]
+           subscriber_sns_topic_arns  = []
+           threshold                  = 20
+           threshold_type             = "PERCENTAGE"
        }
    }

  # aws_budgets_budget.total["FORECASTED"] will be created
+   resource "aws_budgets_budget" "total" {
+       account_id        = (known after apply)
+       arn               = (known after apply)
+       budget_type       = "COST"
+       cost_filters      = (known after apply)
+       id                = (known after apply)
+       limit_amount      = "10"
+       limit_unit        = "USD"
+       name              = "total_budgets"
+       name_prefix       = (known after apply)
+       time_period_end   = "2087-06-15_00:00"
+       time_period_start = (known after apply)
+       time_unit         = "MONTHLY"

+       cost_filter {
+           name   = (known after apply)
+           values = (known after apply)
        }

+       cost_types {
+           include_credit             = true
+           include_discount           = true
+           include_other_subscription = true
+           include_recurring          = true
+           include_refund             = true
+           include_subscription       = true
+           include_support            = true
+           include_tax                = true
+           include_upfront            = true
+           use_amortized              = true
+           use_blended                = false
        }

+       notification {
+           comparison_operator        = "GREATER_THAN"
+           notification_type          = "FORECASTED"
+           subscriber_email_addresses = [
+               "kiririmode@gmail.com",
            ]
+           subscriber_sns_topic_arns  = []
+           threshold                  = 20
+           threshold_type             = "PERCENTAGE"
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.
```
</details>